package com.ow0b.c7b9.app.activity.rhythm;

import java.util.List;

public class RhythmUtil
{
    // 所有8拍子节奏型
    // 第一位储存个数,最后一位储存id，倒数第二位储存时值
    public static float[][] point8RhythmsData = new float[][]
    {
            new float[] {3, 4, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},      //111
            new float[] {4, 2, 2, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2},      //211
            new float[] {4, 4, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3},      //121
            new float[] {4, 4, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4},      //112
            new float[] {5, 2, 2, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 5},      //221
            new float[] {5, 4, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 6},      //122
            new float[] {6, 2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 7},      //222
            new float[] {2, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 8},      //四八
            new float[] {2, 4, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 9},      //八四
            new float[] {1, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 10},      //一大拍
            new float[] {3, 6, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 11},      //前1
            new float[] {3, 2, 6, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 12},      //后1
            new float[] {3, 4, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 13},      //1前
            new float[] {3, 4, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 14},      //1后
            new float[] {4, 6, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 15},      //前2
            new float[] {4, 2, 6, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 16},      //后2
            new float[] {4, 2, 2, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 17},      //2前
            new float[] {4, 2, 2, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 18},      //2后

            new float[] {3, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 19},      //四十六
            new float[] {3, 2, 2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 20},      //十六四

            new float[] {4, 4, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 21},      //1切
            new float[] {4, 2, 4, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 22},      //切1
            new float[] {5, 2, 2, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 23},      //2切
            new float[] {5, 2, 4, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 24},      //切2
            new float[] {4, 2, 4, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 25},      //连切
            new float[] {3, -4, 4, 4, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 26},      //休11
            new float[] {4, -2, 2, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 27},      //休211
            new float[] {4, -4, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 28},      //休21
            new float[] {4, -4, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 29},      //休12
            new float[] {5, -2, 2, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 30},      //休221
            new float[] {5, -4, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 31},      //休22
            new float[] {6, -2, 2, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 32},      //休222
            new float[] {2, -8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 33},      //休八
            new float[] {2, -4, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 34},      //休四
            new float[] {2, 4, -8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 35},      //八休
            new float[] {2, 8, -4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 36},      //四休
            new float[] {3, -8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 37},      //休十六
            new float[] {3, 2, 2, -8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 38},      //十六休
            new float[] {4, -2, 4, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 39},      //休连切

            new float[] {4, -2, 4, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 40},      //休切1
            new float[] {5, -2, 4, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 41},      //休切2
            new float[] {4, -4, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 42},      //休切
            new float[] {3, -6, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 43},      //休前1
            new float[] {4, -6, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 44},      //休前2
            new float[] {3, -2, 6, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 45},      //休后1
            new float[] {4, -2, 6, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 46},      //休后2
            new float[] {3, -4, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 47},      //休前
            new float[] {3, -4, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 48},      //休后

            new float[] {3, 4, -4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 49},      //1休1
            new float[] {3, 4, 4, -4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 50},      //11休


            new float[] {5, 4f / 3f, 4f / 3f, 4f / 3f, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 51},      //三连11
            new float[] {5, 4, 4f / 3f, 4f / 3f, 4f / 3f, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 52},      //1三连1
            new float[] {5, 4, 4, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 53},      //11三连
            new float[] {7, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4, 0, 0, 0, 0, 0, 0, 1, 54},      //三连三连1
            new float[] {7, 4, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 1, 55},      //1三连三连
            new float[] {9, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 1, 56},      //三连三连三连
            new float[] {6, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 1, 57},      //三连21
            new float[] {6, 4f / 3f, 4f / 3f, 4f / 3f, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 58},      //三连12
            new float[] {7, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 1, 59},      //三连22
            new float[] {6, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 4, 0, 0, 0, 0, 0, 0, 0, 1, 60},      //2三连1
            new float[] {6, 4, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 61},      //1三连2
            new float[] {7, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 0, 0, 0, 0, 0, 0, 1, 62},      //2三连2
            new float[] {6, 4, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 63},      //12三连
            new float[] {6, 2, 2, 4, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 64},      //21三连
            new float[] {7, 2, 2, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 1, 65},      //22三连
            new float[] {8, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 0, 0, 0, 0, 0, 1, 66},      //三连三连2
            new float[] {8, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 1, 67},      //2三连三连
            new float[] {5, 6, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 68},      //前三连
            new float[] {5, 2, 6, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 69},      //后三连
            new float[] {5, 4f / 3f, 4f / 3f, 4f / 3f, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 70},      //三连前
            new float[] {5, 4f / 3f, 4f / 3f, 4f / 3f, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 1, 71},      //三连后
            new float[] {6, 4f / 3f, 4f / 3f, 4f / 3f, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 1, 72},      //三连切
            new float[] {6, 2, 4, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 73},      //切三连
            new float[] {5, -4, 4f / 3f, 4f / 3f, 4f / 3f, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 74},      //休三连1
            new float[] {5, -4, 4, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 75},      //休1三连
            new float[] {6, -2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 4, 0, 0, 0, 0, 0, 0, 0, 1, 76},      //休2三连1
            new float[] {6, -2, 2, 4, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 77},      //休21三连
            new float[] {6, -4, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 78},      //休2三连
            new float[] {6, -4, 4f / 3f, 4f / 3f, 4f / 3f, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 79},      //休三连2
            new float[] {7, -2, 2, 2, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 1, 80},      //休22三连
            new float[] {6, -2, 4, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 1, 81},      //休切三连
            new float[] {5, -6, 2, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 82},      //休前三连
            new float[] {5, -2, 6, 4f / 3f, 4f / 3f, 4f / 3f, 0, 0, 0, 0, 0, 0, 0, 0, 1, 83},      //休后三连

            new float[] {5, 3, 1, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 84},      //小小前11
            new float[] {5, 4, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 85},      //1小小前1
            new float[] {5, 4, 4, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 86},      //11小小前
            new float[] {7, 3, 1, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 87},      //小小前小小前1
            new float[] {7, 4, 3, 1, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 88},      //1小小前小小前
            new float[] {9, 3, 1, 3, 1, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 89},      //小小前小小前小小前
            new float[] {6, 3, 1, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 90},      //小小前21
            new float[] {6, 3, 1, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 91},      //小小前12
            new float[] {7, 3, 1, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 92},      //小小前22
            new float[] {6, 2, 2, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 93},      //2小小前1
            new float[] {6, 4, 3, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 94},      //1小小前2
            new float[] {7, 2, 2, 3, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 95},      //2小小前2
            new float[] {6, 4, 2, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 96},      //12小小前
            new float[] {6, 2, 2, 4, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 97},      //21小小前
            new float[] {7, 2, 2, 2, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 98},      //22小小前
            new float[] {8, 3, 1, 3, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 99},      //小小前小小前2
            new float[] {8, 2, 2, 3, 1, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 100},      //2小小前小小前
            new float[] {5, 6, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 101},      //前小小前
            new float[] {5, 2, 6, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 102},      //后小小前
            new float[] {5, 3, 1, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 103},      //小小前前
            new float[] {5, 3, 1, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 104},      //小小前后
            new float[] {6, 3, 1, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 105},      //小小前切
            new float[] {6, 2, 4, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 106},      //切小小前
            new float[] {5, -4, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 107},      //休小小前1
            new float[] {5, -4, 4, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 108},      //休1小小前
            new float[] {6, -2, 2, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 109},      //休2小小前1
            new float[] {6, -2, 2, 4, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 110},      //休21小小前
            new float[] {6, -4, 2, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 111},      //休2小小前
            new float[] {6, -4, 3, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 112},      //休小小前2
            new float[] {7, -2, 2, 2, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 113},      //休22小小前
            new float[] {6, -2, 4, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 114},      //休切小小前
            new float[] {5, -6, 2, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 115},      //休前小小前
            new float[] {5, -2, 6, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 116},      //休后小小前

            new float[] {5, 1, 3, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 117},      //小小后11
            new float[] {5, 4, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 118},      //1小小后1
            new float[] {5, 4, 4, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 119},      //11小小后
            new float[] {7, 1, 3, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 120},      //小小后小小后1
            new float[] {7, 4, 1, 3, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 121},      //1小小后小小后
            new float[] {9, 1, 3, 1, 3, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 122},      //小小后小小后小小后
            new float[] {6, 1, 3, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 123},      //小小后21
            new float[] {6, 1, 3, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 124},      //小小后12
            new float[] {7, 1, 3, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 125},      //小小后22
            new float[] {6, 2, 2, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 126},      //2小小后1
            new float[] {6, 4, 1, 3, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 127},      //1小小后2
            new float[] {7, 2, 2, 1, 3, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 128},      //2小小后2
            new float[] {6, 4, 2, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 129},      //12小小后
            new float[] {6, 2, 2, 4, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 130},      //21小小后
            new float[] {7, 2, 2, 2, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 131},      //22小小后
            new float[] {8, 1, 3, 1, 3, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 132},      //小小后小小后2
            new float[] {8, 2, 2, 1, 3, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 133},      //2小小后小小后
            new float[] {5, 6, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 134},      //前小小后
            new float[] {5, 2, 6, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 135},      //后小小后
            new float[] {5, 1, 3, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 136},      //小小后前
            new float[] {5, 1, 3, 2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 137},      //小小后后
            new float[] {6, 1, 3, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 138},      //小小后切
            new float[] {6, 2, 4, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 139},      //切小小后
            new float[] {5, -4, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 140},      //休小小后1
            new float[] {5, -4, 4, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 141},      //休1小小后
            new float[] {6, -2, 2, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 142},      //休2小小后1
            new float[] {6, -2, 2, 4, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 143},      //休21小小后
            new float[] {6, -4, 2, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 144},      //休2小小后
            new float[] {6, -4, 1, 3, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 1, 145},      //休小小后2
            new float[] {7, -2, 2, 2, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 146},      //休22小小后
            new float[] {6, -2, 4, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 147},      //休切小小后
            new float[] {5, -6, 2, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 148},      //休前小小后
            new float[] {5, -2, 6, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 149},      //休后小小后

            new float[] {7, 1, 3, 3, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 150},      //小小后小小前1
            new float[] {7, 3, 1, 1, 3, 4, 0, 0, 0, 0, 0, 0, 0, 0, 1, 151},      //小小前小小后1
            new float[] {7, 4, 1, 3, 3, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 152},      //1小小后小小前
            new float[] {7, 4, 3, 1, 1, 3, 0, 0, 0, 0, 0, 0, 0, 0, 1, 153},      //1小小前小小后
            new float[] {9, 3, 1, 1, 3, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 154},      //小小前小小后小小后
            new float[] {9, 1, 3, 3, 1, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 155},      //小小后小小前小小后
            new float[] {9, 1, 3, 1, 3, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 156},      //小小后小小后小小前
            new float[] {9, 3, 1, 3, 1, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 157},      //小小前小小前小小后
            new float[] {9, 1, 3, 3, 1, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 158},      //小小后小小前小小前
            new float[] {8, 1, 3, 3, 1, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 159},      //小小后小小前2
            new float[] {8, 3, 1, 1, 3, 2, 2, 0, 0, 0, 0, 0, 0, 0, 1, 160},      //小小前小小后2
            new float[] {8, 2, 2, 1, 3, 3, 1, 0, 0, 0, 0, 0, 0, 0, 1, 161},      //2小小后小小前
            new float[] {8, 2, 2, 3, 1, 1, 3, 0, 0, 0, 0, 0, 0, 0, 1, 162},      //2小小前小小后
    };

    // 所有4拍子节奏型
    // 第一位储存个数,最后一位储存id，倒数第二位储存时值
    public static float[][] point4RhythmsData = new float[][]
    {
            new float[] {1, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1},      //一拍
            new float[] {2, 4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 2},      //二八
            new float[] {3, 2, 2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 3},      //前十六
            new float[] {3, 4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 4},      //后十六
            new float[] {4, 2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 5},      //四十六
            new float[] {2, 6, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 6},      //小前
            new float[] {2, 2, 6, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 7},      //小后
            new float[] {3, 2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 8},      //小切分
            new float[] {3, 8f/3f, 8f/3f, 8f/3f, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 9},      //三连音，只需一位0和紧跟0后的 时值+连音数（简单表示，感觉迟早要出问题）

            new float[] {3, -8f/3f, 8f/3f, 8f/3f, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 10},      //休三连
            new float[] {2, -4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 11},      //休八
            new float[] {2, 4, -4, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 12},      //八休
            new float[] {3, -4, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 13},      //休十六
            new float[] {3, 2, 2, -4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 14},      //十六休
            new float[] {3, -2, 4, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 15},      //休小切
            new float[] {4, -2, 2, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 16},      //休四十六

            new float[] {1, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 17},      //两拍
            new float[] {2, 12, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 18},      //大前
            new float[] {2, 4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 19},      //大后
            new float[] {3, 12, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 20},      //大前后十六
            new float[] {3, 2, 2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 21},      //大后前十六
            new float[] {3, 4, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 22},       //大切分
            new float[] {4, 2, 2, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 23},       //大切前十六
            new float[] {4, 4, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 24},       //大切后十六
            new float[] {5, 2, 2, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 2, 25},       //大切前后十六
            new float[] {3, -4, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 26},       //大切前休
            new float[] {4, -4, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 27},       //大切后十六前休
            new float[] {2, -4, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 28},      //大后前休

            new float[] {4, 4, 8, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 29},      //连切
            new float[] {5, 2, 2, 8, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 3, 30},      //连切前十六
            new float[] {5, 4, 8, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 3, 31},      //连切后十六
            new float[] {6, 2, 2, 8, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 3, 32},      //连切前后十六
            new float[] {4, -4, 8, 8, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 33},      //连切前休
            new float[] {4, 4, 8, 8, -4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 3, 34},      //连切后休
            new float[] {5, 2, 2, 8, 8, -4, 0, 0, 0, 0, 0, 0, 0, 0, 3, 35},      //连切前十六后休
            new float[] {5, -4, 8, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 3, 36},      //连切后十六前休

            new float[] {5, -4, 8, 8, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 3, 36},      //休十六
    };

    public static String nameOf(boolean four, int id)
    {
        if (four)
        {
            switch (id)
            {
                case 0:
                    return "\n";
                case 1:
                    return "一拍";
                case 2:
                    return "二八";
                case 3:
                    return "前十六";
                case 4:
                    return "后十六";
                case 5:
                    return "四十六";
                case 6:
                    return "小前";
                case 7:
                    return "小后";
                case 8:
                    return "小切分";
                case 9:
                    return "三连音";
                case 10:
                    return "休三连";
                case 11:
                    return "休八";
                case 12:
                    return "八休";
                case 13:
                    return "休十六";
                case 14:
                    return "十六休";
                case 15:
                    return "休小切";
                case 16:
                    return "休四十六";
                case 17:
                    return "两拍";
                case 18:
                    return "大前";
                case 19:
                    return "大后";
                case 20:
                    return "大前后十六";
                case 21:
                    return "大后前十六";
                case 22:
                    return "大切分";
                case 23:
                    return "大切前十六";
                case 24:
                    return "大切后十六";
                case 25:
                    return "大切前后十六";
                case 26:
                    return "大切前休";
                case 27:
                    return "大切后十六前休";
                case 28:
                    return "大后前休";
                case 29:
                    return "连切";
                case 30:
                    return "连切前十六";
                case 31:
                    return "连切后十六";
                case 32:
                    return "连切前后十六";
                case 33:
                    return "连切前休";
                case 34:
                    return "连切后休";
                case 35:
                    return "连切前十六后休";
                case 36:
                    return "连切后十六前休";
            }
        }
        else
        {
            switch (id)
            {
                case 0:
                    return "\n";
                case 1:
                    return "111";
                case 2:
                    return "211";
                case 3:
                    return "121";
                case 4:
                    return "112";
                case 5:
                    return "221";
                case 6:
                    return "122";
                case 7:
                    return "222";
                case 8:
                    return "四八";
                case 9:
                    return "八四";
                case 10:
                    return "一大拍";
                case 11:
                    return "前1";
                case 12:
                    return "后1";
                case 13:
                    return "1前";
                case 14:
                    return "1后";
                case 15:
                    return "前2";
                case 16:
                    return "后2";
                case 17:
                    return "2前";
                case 18:
                    return "2后";

                case 19:
                    return "四十六";
                case 20:
                    return "十六四";

                case 21:
                    return "1切";
                case 22:
                    return "切1";
                case 23:
                    return "2切";
                case 24:
                    return "切2";
                case 25:
                    return "连切";
                case 26:
                    return "休11";
                case 27:
                    return "休211";
                case 28:
                    return "休21";
                case 29:
                    return "休12";
                case 30:
                    return "休221";
                case 31:
                    return "休22";
                case 32:
                    return "休222";
                case 33:
                    return "休八";
                case 34:
                    return "休四";
                case 35:
                    return "八休";
                case 36:
                    return "四休";
                case 37:
                    return "休十六";
                case 38:
                    return "十六休";
                case 39:
                    return "休连切";

                case 40:
                    return "休切1";
                case 41:
                    return "休切2";
                case 42:
                    return "休切";
                case 43:
                    return "休前1";
                case 44:
                    return "休前2";
                case 45:
                    return "休后1";
                case 46:
                    return "休后2";
                case 47:
                    return "休前";
                case 48:
                    return "休后";


                case 49:
                    return "1休1";
                case 50:
                    return "11休";





                case 51:
                    return "三连11";
                case 52:
                    return "1三连1";
                case 53:
                    return "11三连";
                case 54:
                    return "三连三连1";
                case 55:
                    return "1三连三连";
                case 56:
                    return "三连三连三连";
                case 57:
                    return "三连21";
                case 58:
                    return "三连12";
                case 59:
                    return "三连22";
                case 60:
                    return "2三连1";
                case 61:
                    return "1三连2";
                case 62:
                    return "2三连2";
                case 63:
                    return "12三连";
                case 64:
                    return "21三连";
                case 65:
                    return "22三连";
                case 66:
                    return "三连三连2";
                case 67:
                    return "2三连三连";
                case 68:
                    return "前三连";
                case 69:
                    return "后三连";
                case 70:
                    return "三连前";
                case 71:
                    return "三连后";
                case 72:
                    return "三连切";
                case 73:
                    return "切三连";
                case 74:
                    return "休三连1";
                case 75:
                    return "休1三连";
                case 76:
                    return "休2三连1";
                case 77:
                    return "休21三连";
                case 78:
                    return "休2三连";
                case 79:
                    return "休三连2";
                case 80:
                    return "休22三连";
                case 81:
                    return "休切三连";
                case 82:
                    return "休前三连";
                case 83:
                    return "休后三连";




                case 84:
                    return "小小前11";
                case 85:
                    return "1小小前1";
                case 86:
                    return "11小小前";
                case 87:
                    return "小小前小小前1";
                case 88:
                    return "1小小前小小前";
                case 89:
                    return "小小前小小前小小前";
                case 90:
                    return "小小前21";
                case 91:
                    return "小小前12";
                case 92:
                    return "小小前22";
                case 93:
                    return "2小小前1";
                case 94:
                    return "1小小前2";
                case 95:
                    return "2小小前2";
                case 96:
                    return "12小小前";
                case 97:
                    return "21小小前";
                case 98:
                    return "22小小前";
                case 99:
                    return "小小前小小前2";
                case 100:
                    return "2小小前小小前";
                case 101:
                    return "前小小前";
                case 102:
                    return "后小小前";
                case 103:
                    return "小小前前";
                case 104:
                    return "小小前后";
                case 105:
                    return "小小前切";
                case 106:
                    return "切小小前";
                case 107:
                    return "休小小前1";
                case 108:
                    return "休1小小前";
                case 109:
                    return "休2小小前1";
                case 110:
                    return "休21小小前";
                case 111:
                    return "休2小小前";
                case 112:
                    return "休小小前2";
                case 113:
                    return "休22小小前";
                case 114:
                    return "休切小小前";
                case 115:
                    return "休前小小前";
                case 116:
                    return "休后小小前";




                case 117:
                    return "小小后11";
                case 118:
                    return "1小小后1";
                case 119:
                    return "11小小后";
                case 120:
                    return "小小后小小后1";
                case 121:
                    return "1小小后小小后";
                case 122:
                    return "小小后小小后小小后";
                case 123:
                    return "小小后21";
                case 124:
                    return "小小后12";
                case 125:
                    return "小小后22";
                case 126:
                    return "2小小后1";
                case 127:
                    return "1小小后2";
                case 128:
                    return "2小小后2";
                case 129:
                    return "12小小后";
                case 130:
                    return "21小小后";
                case 131:
                    return "22小小后";
                case 132:
                    return "小小后小小后2";
                case 133:
                    return "2小小后小小后";
                case 134:
                    return "前小小后";
                case 135:
                    return "后小小后";
                case 136:
                    return "小小后前";
                case 137:
                    return "小小后后";
                case 138:
                    return "小小后切";
                case 139:
                    return "切小小后";
                case 140:
                    return "休小小后1";
                case 141:
                    return "休1小小后";
                case 142:
                    return "休2小小后1";
                case 143:
                    return "休21小小后";
                case 144:
                    return "休2小小后";
                case 145:
                    return "休小小后2";
                case 146:
                    return "休22小小后";
                case 147:
                    return "休切小小后";
                case 148:
                    return "休前小小后";
                case 149:
                    return "休后小小后";



                case 150:
                    return "小小后小小前1";
                case 151:
                    return "小小前小小后1";
                case 152:
                    return "1小小后小小前";
                case 153:
                    return "1小小前小小后";
                case 154:
                    return "小小前小小后小小后";
                case 155:
                    return "小小后小小前小小后";
                case 156:
                    return "小小后小小后小小前";
                case 157:
                    return "小小前小小前小小后";
                case 158:
                    return "小小后小小前小小前";
                case 159:
                    return "小小后小小前2";
                case 160:
                    return "小小前小小后2";
                case 161:
                    return "2小小后小小前";
                case 162:
                    return "2小小前小小后";
            }
        }
        throw new RuntimeException("不存在的节奏型编号：" + id);
    }

    /// （4拍子）获取不同设置对应开启关闭的节奏型id
    public static List<Integer> getPoint4Opt(String name)
    {
        return switch (name)
        {
            case "一拍/两拍/二八/十六" -> List.of(1, 2, 3, 4, 5, 17);
            case "小前/后/切分" -> List.of(6, 7, 8);
            case "三连音" -> List.of(9);
            case "八休/休八(十六)" -> List.of(11, 12, 13, 14);
            case "休切/四六/三连" -> List.of(10, 15, 16);
            case "两拍节奏不带休止" -> List.of(18, 19, 20, 21, 22, 23, 24, 25);
            case "两拍节奏带休止" -> List.of(26, 27, 28);
            case "连切" -> List.of(29);
            case "连切带休止" -> List.of(30, 31, 32, 33, 34, 35, 36);
            default -> List.of();
        };
    }

    /// （8拍子）获取不同设置对应开启关闭的节奏型id
    public static List<Integer> getPoint8Opt(String name)
    {
        return switch (name)
        {
            case "一大拍/四八八四(十六)" ->
                    List.of(8, 9, 10, 19, 20);
            case "12节奏" ->
                    List.of(1, 2, 3, 4, 5, 6, 7);
            case "12节奏+前后切" ->
                    List.of(11, 12, 13, 14, 15, 16, 17, 18, 21, 22, 23, 24);
            case "12节奏+休止" ->
                    List.of(26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 49, 50);
            case "12节奏+前后切+休止" ->
                    List.of(40, 41, 42, 43, 44, 45, 46, 47, 48);
            case "连切" ->
                    List.of(25);
            case "连切+休止" ->
                    List.of(39);
            case "三连音替换" ->
                    List.of(51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83);
            case "小小前/后替换" ->
                    List.of(84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162);
            default ->
                    List.of();
        };
    }
}
